In [1]:
import pandas as pd

In [2]:
employee = pd.read_csv('data/employee.csv', parse_dates=['JOB_DATE', 'HIRE_DATE'], index_col='HIRE_DATE')

In [3]:
employee.head(3)

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,JOB_DATE
HIRE_DATE,,,,,,,,,
2006-06-12,0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,Active,2012-10-13
2000-07-19,1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,Active,2010-09-18
2015-02-03,2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03

#### get avg salary by gender

In [4]:
employee.groupby('GENDER')['BASE_SALARY'].mean().round(-2)

GENDER
Female    52200.0
Male      57400.0
Name: BASE_SALARY, dtype: float64

#### getting avg salaray based on hire date, grouping by the index timestamp column

In [5]:
employee.resample('10AS')['BASE_SALARY'].mean().round(-2)  # 10AS - 10-year increment of time offset

HIRE_DATE
1958-01-01     81200.0
1968-01-01    106500.0
1978-01-01     69600.0
1988-01-01     62300.0
1998-01-01     58200.0
2008-01-01     47200.0
Freq: 10AS-JAN, Name: BASE_SALARY, dtype: float64

In [6]:
sal_avg = employee.groupby('GENDER').resample('10AS')['BASE_SALARY'].mean().round(-2)

In [7]:
sal_avg  # by gender and hiredate

GENDER  HIRE_DATE
Female  1975-01-01     51600.0
        1985-01-01     57600.0
        1995-01-01     55500.0
        2005-01-01     51700.0
        2015-01-01     38600.0
Male    1958-01-01     81200.0
        1968-01-01    106500.0
        1978-01-01     72300.0
        1988-01-01     64600.0
        1998-01-01     59700.0
        2008-01-01     47200.0
Name: BASE_SALARY, dtype: float64

In [8]:
sal_avg.unstack('GENDER')

GENDER       Female      Male
HIRE_DATE
1958-01-01      NaN   81200.0
1968-01-01      NaN  106500.0
1975-01-01  51600.0       NaN
1978-01-01      NaN   72300.0
1985-01-01  57600.0       NaN
1988-01-01      NaN   64600.0
1995-01-01  55500.0       NaN
1998-01-01      NaN   59700.0
2005-01-01  51700.0       NaN
2008-01-01      NaN   47200.0
2015-01-01  38600.0       NaN

#### male and female first hire dates

In [9]:
employee[employee['GENDER'] == 'Male'].index.min()

Timestamp('1958-12-29 00:00:00')

In [10]:
employee[employee['GENDER'] == 'Female'].index.min()

Timestamp('1975-06-09 00:00:00')

#### Due to different start dates, some data will be missing for male/female gender

In [11]:
sal_avg1 = employee.groupby(['GENDER',  pd.Grouper(freq='10AS')])['BASE_SALARY'].mean().round(-2)

In [12]:
sal_avg1

GENDER  HIRE_DATE
Female  1968-01-01         NaN
        1978-01-01     57100.0
        1988-01-01     57100.0
        1998-01-01     54700.0
        2008-01-01     47300.0
Male    1958-01-01     81200.0
        1968-01-01    106500.0
        1978-01-01     72300.0
        1988-01-01     64600.0
        1998-01-01     59700.0
        2008-01-01     47200.0
Name: BASE_SALARY, dtype: float64

In [13]:
sal_final = sal_avg1.unstack('GENDER')
sal_final

GENDER       Female      Male
HIRE_DATE
1958-01-01      NaN   81200.0
1968-01-01      NaN  106500.0
1978-01-01  57100.0   72300.0
1988-01-01  57100.0   64600.0
1998-01-01  54700.0   59700.0
2008-01-01  47300.0   47200.0

#### changing the index values to 10 year range

In [14]:
years = sal_final.index.year
years

Int64Index([1958, 1968, 1978, 1988, 1998, 2008], dtype='int64', name='HIRE_DATE')

In [15]:
years_right = years + 9
years_right

Int64Index([1967, 1977, 1987, 1997, 2007, 2017], dtype='int64', name='HIRE_DATE')

In [16]:
sal_final.index = years.astype(str) + '-' + years_right.astype(str)

In [17]:
sal_final

GENDER      Female      Male
HIRE_DATE
1958-1967      NaN   81200.0
1968-1977      NaN  106500.0
1978-1987  57100.0   72300.0
1988-1997  57100.0   64600.0
1998-2007  54700.0   59700.0
2008-2017  47300.0   47200.0